Revit 2026 API

# FamilyManagerCurrentType Property

---

The current family type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyType CurrentType { get; set; }
```
```vb
Public Property CurrentType As FamilyType
	Get
	Set
```
```cpp
public:
property FamilyType^ CurrentType {
	FamilyType^ get ();
	void set (FamilyType^ value);
}
```
```fsharp
member CurrentType : FamilyType with get, set
```

#### Property Value

FamilyType

Only the current family type is editable using the methods in FamilyManager. If you want to modify the properties of any family type, it must be set to be the current type first. This value will be  if there is no type in the family. In order to modify parameter values, you will need to create one using NewType(String).

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace